In [70]:
import pandas as pd

In [71]:
df_1 = pd.DataFrame({
    'col1': [1,2,3],
    'col2': ['A','B','C']
}, index=['x','y','z'])
df_1.head()

'''
df_1 = pd.DataFrame([
    [1,2,3],
    ['A','B','C']
], columns=['SG', 'AT','HI'], index=['x','y'])
df_1.head()
'''

"\ndf_1 = pd.DataFrame([\n    [1,2,3],\n    ['A','B','C']\n], columns=['SG', 'AT','HI'], index=['x','y'])\ndf_1.head()\n"

In [72]:
df_1.columns

Index(['col1', 'col2'], dtype='object')

In [73]:
df_1.columns = ['c1', 'c2']
df_1.columns

Index(['c1', 'c2'], dtype='object')

In [74]:
df_1.index

Index(['x', 'y', 'z'], dtype='object')

In [75]:
df_1

   c1 c2
x   1  A
y   2  B
z   3  C

In [76]:
df_1.shape

(3, 2)

In [77]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      3 non-null      int64
 1   c2      3 non-null      object
dtypes: int64(1), object(1)
memory usage: 72.0+ bytes

In [186]:
df_1.describe()#.loc['count']

        c1
count  3.0
mean   2.0
std    1.0
min    1.0
25%    1.5
50%    2.0
75%    2.5
max    3.0

In [79]:
df_1.dtypes

c1     int64
c2    object
dtype: object

In [80]:
df_1.nunique()

c1    3
c2    3
dtype: int64

In [81]:
(df_1['c1'].unique())

array([1, 2, 3])

In [82]:
coffee_df = pd.read_csv('/Users/shakshigandhi/Downloads/Pandas_practice_YT/complete-pandas-tutorial/warmup-data/coffee.csv')
coffee_df.head()
#pd.read_parquet()
#pd.read_excel('',sheet_name='')

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [83]:
coffee_df.sample(5, random_state=42)

          Day Coffee Type  Units Sold
9      Friday       Latte          35
11   Saturday       Latte          35
0      Monday    Espresso          25
12     Sunday    Espresso          45
5   Wednesday       Latte          25

In [84]:
print(coffee_df.loc[9,:])
print(coffee_df.loc[(9,11,0),:])

Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object
         Day Coffee Type  Units Sold
9     Friday       Latte          35
11  Saturday       Latte          35
0     Monday    Espresso          25

In [85]:
coffee_df.iloc[9,1]

'Latte'

In [86]:
coffee_df.index = coffee_df['Coffee Type']
coffee_df.index

Index(['Espresso', 'Latte', 'Espresso', 'Latte', 'Espresso', 'Latte',
       'Espresso', 'Latte', 'Espresso', 'Latte', 'Espresso', 'Latte',
       'Espresso', 'Latte'],
      dtype='object', name='Coffee Type')

In [ ]:
coffee_df = coffee_df.reset_index(drop=True)
coffee_df.index

RangeIndex(start=0, stop=14, step=1)

In [89]:
coffee_df

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [ ]:
coffee_df.nunique()

Day            7
Coffee Type    2
Units Sold     7
dtype: int64

In [96]:
coffee_df["Units Sold"]

0     25
1     15
2     30
3     20
4     35
5     25
6     40
7     30
8     45
9     35
10    45
11    35
12    45
13    35
Name: Units Sold, dtype: int64

In [99]:
coffee_df["Units Sold"].unique()

array([25, 15, 30, 20, 35, 40, 45])

In [101]:
coffee_df["Units Sold"].nunique()

7

In [102]:
coffee_df.sort_values('Day',ascending=True)

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
9      Friday       Latte          35
0      Monday    Espresso          25
1      Monday       Latte          15
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35
6    Thursday    Espresso          40
7    Thursday       Latte          30
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25

In [187]:
coffee_df['Units Sold'].sort_values()

1     15
3     20
5     25
0     25
7     30
2     30
9     35
11    35
13    35
4     35
6     40
8     45
10    45
12    45
Name: Units Sold, dtype: int64

In [105]:
coffee_df.sort_values('Units Sold',ascending=False)

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [111]:
print(coffee_df['Coffee Type'].unique())
coffee_df['Coffee Type'].value_counts()

['Espresso' 'Latte']

Coffee Type
Espresso    7
Latte       7
Name: count, dtype: int64

In [118]:
coffee_df = coffee_df.sort_values(['Coffee Type', 'Units Sold'], ascending=(False, True))

In [123]:
for x,y in coffee_df.iterrows():
    print(x, y)

1 Day            Monday
Coffee Type     Latte
Units Sold         15
Name: 1, dtype: object
3 Day            Tuesday
Coffee Type      Latte
Units Sold          20
Name: 3, dtype: object
5 Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: 5, dtype: object
7 Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object
9 Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object
11 Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: 11, dtype: object
13 Day            Sunday
Coffee Type     Latte
Units Sold         35
Name: 13, dtype: object
0 Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object
2 Day             Tuesday
Coffee Type    Espresso
Units Sold           30
Name: 2, dtype: object
4 Day            Wednesday
Coffee Type     Espresso
Units Sold            35
Name: 4, dtype: object
6 Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: 6, dtype: object
8 Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object
10 Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object
12 Day              Sunday
Coffee Type    Espresso
Units Sold           45
Name: 12, dtype: object

In [ ]:
#coffee_df
coffee_df['Coffee Type'] == 'Latte'

1      True
3      True
5      True
7      True
9      True
11     True
13     True
0     False
2     False
4     False
6     False
8     False
10    False
12    False
Name: Coffee Type, dtype: bool

In [136]:
coffee_df[coffee_df['Coffee Type'] == 'Latte'][['Day','Coffee Type']]

          Day Coffee Type
1      Monday       Latte
3     Tuesday       Latte
5   Wednesday       Latte
7    Thursday       Latte
9      Friday       Latte
11   Saturday       Latte
13     Sunday       Latte

In [148]:
coffee_df[coffee_df['Day'].str.lower().str.contains('t')]

         Day Coffee Type  Units Sold
3    Tuesday       Latte          20
7   Thursday       Latte          30
11  Saturday       Latte          35
2    Tuesday    Espresso          30
6   Thursday    Espresso          40
10  Saturday    Espresso          45

In [162]:
coffee_df[coffee_df.Day.isin(['Monday', 'Wednesday'])]

         Day Coffee Type  Units Sold
1     Monday       Latte          15
5  Wednesday       Latte          25
0     Monday    Espresso          25
4  Wednesday    Espresso          35

In [167]:
list_1 = ['a','B']
list_2 = []
for x in list_1:
    list_2.append(x.lower())
print(list_2)

['a', 'b']

In [178]:
coffee_df[coffee_df['Units Sold']!=20].sort_index()

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [193]:
coffee_df[['Day','Coffee Type']].value_counts()

Day        Coffee Type
Friday     Espresso       1
           Latte          1
Monday     Espresso       1
           Latte          1
Saturday   Espresso       1
           Latte          1
Sunday     Espresso       1
           Latte          1
Thursday   Espresso       1
           Latte          1
Tuesday    Espresso       1
           Latte          1
Wednesday  Espresso       1
           Latte          1
Name: count, dtype: int64

In [194]:
from sklearn.datasets import fetch_california_housing

In [199]:
housing_df = fetch_california_housing(as_frame=True).frame

In [200]:
housing_df

,MedInc,HouseAge,AveRooms,AveBedrms,Population,AveOccup,Latitude,Longitude,MedHouseVal
0,8.3252,41.0,6.984127,1.023810,322.0,2.555556,37.88,-122.23,4.526
1,8.3014,21.0,6.238137,0.971880,2401.0,2.109842,37.86,-122.22,3.585
2,7.2574,52.0,8.288136,1.073446,496.0,2.802260,37.85,-122.24,3.521
3,5.6431,52.0,5.817352,1.073059,558.0,2.547945,37.85,-122.25,3.413
4,3.8462,52.0,6.281853,1.081081,565.0,2.181467,37.85,-122.25,3.422
...,...,...,...,...,...,...,...,...,...
20635,1.5603,25.0,5.045455,1.133333,845.0,2.560606,39.48,-121.09,0.781
20636,2.5568,18.0,6.114035,1.315789,356.0,3.122807,39.49,-121.21,0.771
20637,1.7000,17.0,5.205543,1.120092,1007.0,2.325635,39.43,-121.22,0.923
20638,1.8672,18.0,5.329513,1.171920,741.0,2.123209,39.43,-121.32,0.847
20639,2.3886,16.0,5.254717,1.162264,1387.0,2.616981,39.37,-121.24,0.894

In [201]:
c_df = coffee_df[0:2]
c_df

       Day Coffee Type  Units Sold
1   Monday       Latte          15
3  Tuesday       Latte          20

In [202]:
c = c_df.to_dict()
c

{'Day': {1: 'Monday', 3: 'Tuesday'},
 'Coffee Type': {1: 'Latte', 3: 'Latte'},
 'Units Sold': {1: 15, 3: 20}}

In [203]:
for index, val in c.items():
    print(index, val)

Day {1: 'Monday', 3: 'Tuesday'}
Coffee Type {1: 'Latte', 3: 'Latte'}
Units Sold {1: 15, 3: 20}

In [ ]:
'''
set_index
min(), max(), mean, mode, median, sum
map(fnc_name, list)
df.house.apply(fnc_name) #and fnc takes x as argument
drop('summary', axis = 1) #axis = 0 means for 'summary' in rows & axis = 1 means for 'summary' in columns drop 'summary'
dropna()
fillna()
drop_duplicates()
notna()
iterrows(), items()
filter using [df.age > 50] & [df.house_rooms <4]
.str.endswith('e')
.dt.year
.isin(ages) #ages = [10,20]
df.groupby('city').agg({
    'col_name_example_mean_age' = 'mean',
    'col_name_example_mean_rooms' = ['mean', 'sum']
})
pd.concat([df1,df2])
pd.merge([df1,df2], on = '', how = 'left')
df1.join(df2, on = '', how = 'left')
'''